tests/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 50
      name: "Warm up"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load"
    - duration: 30
      arrivalRate: 200
      name: "Peak load"
  processor: "./test-processor.js"

scenarios:
  - name: "Create and access short URLs"
    flow:
      - post:
          url: "/shorten"
          json:
            url: "https://example.com/test-url-{{ $randomNumber() }}"
          capture:
            - json: "$.shortId"
              as: "shortId"
      - get:
          url: "/{{ shortId }}"
      - get:
          url: "/stats/{{ shortId }}"